package jiebago

import (
	"regexp"
	"testing"
)

var (
	test_contents = []string{
		"这是一个伸手不见五指的黑夜。我叫孙悟空，我爱北京，我爱Python和C++。",
		"我不喜欢日本和服。",
		"雷猴回归人间。",
		"工信处女干事每月经过下属科室都要亲口交代24口交换机等技术性器件的安装工作",
		"我需要廉租房",
		"永和服装饰品有限公司",
		"我爱北京天安门",
		"abc",
		"隐马尔可夫",
		"雷猴是个好网站",
		"“Microsoft”一词由“MICROcomputer（微型计算机）”和“SOFTware（软件）”两部分组成",
		"草泥马和欺实马是今年的流行词汇",
		"伊藤洋华堂总府店",
		"中国科学院计算技术研究所",
		"罗密欧与朱丽叶",
		"我购买了道具和服装",
		"PS: 我觉得开源有一个好处，就是能够敦促自己不断改进，避免敞帚自珍",
		"湖北省石首市",
		"湖北省十堰市",
		"总经理完成了这件事情",
		"电脑修好了",
		"做好了这件事情就一了百了了",
		"人们审美的观点是不同的",
		"我们买了一个美的空调",
		"线程初始化时我们要注意",
		"一个分子是由好多原子组织成的",
		"祝你马到功成",
		"他掉进了无底洞里",
		"中国的首都是北京",
		"孙君意",
		"外交部发言人马朝旭",
		"领导人会议和第四届东亚峰会",
		"在过去的这五年",
		"还需要很长的路要走",
		"60周年首都阅兵",
		"你好人们审美的观点是不同的",
		"买水果然后来世博园",
		"买水果然后去世博园",
		"但是后来我才知道你是对的",
		"存在即合理",
		"的的的的的在的的的的就以和和和",
		"I love你，不以为耻，反以为rong",
		"因",
		"",
		"hello你好人们审美的观点是不同的",
		"很好但主要是基于网页形式",
		"hello你好人们审美的观点是不同的",
		"为什么我不能拥有想要的生活",
		"后来我才",
		"此次来中国是为了",
		"使用了它就可以解决一些问题",
		",使用了它就可以解决一些问题",
		"其实使用了它就可以解决一些问题",
		"好人使用了它就可以解决一些问题",
		"是因为和国家",
		"老年搜索还支持",
		"干脆就把那部蒙人的闲法给废了拉倒！RT @laoshipukong : 27日，全国人大常委会第三次审议侵权责任法草案，删除了有关医疗损害责任“举证倒置”的规定。在医患纠纷中本已处于弱势地位的消费者由此将陷入万劫不复的境地。 ",
		"大",
		"",
		"他说的确实在理",
		"长春市长春节讲话",
		"结婚的和尚未结婚的",
		"结合成分子时",
		"旅游和服务是最好的",
		"这件事情的确是我的错",
		"供大家参考指正",
		"哈尔滨政府公布塌桥原因",
		"我在机场入口处",
		"邢永臣摄影报道",
		"BP神经网络如何训练才能在分类时增加区分度？",
		"南京市长江大桥",
		"应一些使用者的建议，也为了便于利用NiuTrans用于SMT研究",
		"长春市长春药店",
		"邓颖超生前最喜欢的衣服",
		"胡锦涛是热爱世界和平的政治局常委",
		"程序员祝海林和朱会震是在孙健的左面和右面, 范凯在最右面.再往左是李松洪",
		"一次性交多少钱",
		"两块五一套，三块八一斤，四块七一本，五块六一条",
		"小和尚留了一个像大和尚一样的和尚头",
		"我是中华人民共和国公民;我爸爸是共和党党员; 地铁和平门站",
		"张晓梅去人民医院做了个B超然后去买了件T恤",
		"AT&T是一件不错的公司，给你发offer了吗？",
		"C++和c#是什么关系？11+122=133，是吗？PI=3.14159",
		"你认识那个和主席握手的的哥吗？他开一辆黑色的士。",
		"枪杆子中出政权"}

	defaultCutResult = [][]string{
		[]string{"\u8fd9\u662f", "\u4e00\u4e2a", "\u4f38\u624b\u4e0d\u89c1\u4e94\u6307", "\u7684", "\u9ed1\u591c", "\u3002", "\u6211", "\u53eb", "\u5b59\u609f\u7a7a", "\uff0c", "\u6211", "\u7231", "\u5317\u4eac", "\uff0c", "\u6211", "\u7231", "Python", "\u548c", "C++", "\u3002"},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c\u670d", "\u3002"},
		[]string{"\u96f7\u7334", "\u56de\u5f52", "\u4eba\u95f4", "\u3002"},
		[]string{"\u5de5\u4fe1\u5904", "\u5973\u5e72\u4e8b", "\u6bcf\u6708", "\u7ecf\u8fc7", "\u4e0b\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u4ea4\u4ee3", "24", "\u53e3", "\u4ea4\u6362\u673a", "\u7b49", "\u6280\u672f\u6027", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df\u623f"},
		[]string{"\u6c38\u548c", "\u670d\u88c5", "\u9970\u54c1", "\u6709\u9650\u516c\u53f8"},
		[]string{"\u6211", "\u7231", "\u5317\u4eac", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690", "\u9a6c\u5c14\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"\u201c", "Microsoft", "\u201d", "\u4e00\u8bcd", "\u7531", "\u201c", "MICROcomputer", "\uff08", "\u5fae\u578b", "\u8ba1\u7b97\u673a", "\uff09", "\u201d", "\u548c", "\u201c", "SOFTware", "\uff08", "\u8f6f\u4ef6", "\uff09", "\u201d", "\u4e24", "\u90e8\u5206", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5\u9a6c", "\u548c", "\u6b3a\u5b9e", "\u9a6c", "\u662f", "\u4eca\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a\u85e4", "\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd\u79d1\u5b66\u9662\u8ba1\u7b97\u6280\u672f\u7814\u7a76\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211", "\u8d2d\u4e70", "\u4e86", "\u9053\u5177", "\u548c", "\u670d\u88c5"},
		[]string{"PS", ":", " ", "\u6211", "\u89c9\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d\u5904", "\uff0c", "\u5c31\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad\u6539\u8fdb", "\uff0c", "\u907f\u514d", "\u655e\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317\u7701", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317\u7701", "\u5341\u5830\u5e02"},
		[]string{"\u603b\u7ecf\u7406", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00\u4e86\u767e\u4e86", "\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb\u5316", "\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d\u591a", "\u539f\u5b50", "\u7ec4\u7ec7", "\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95\u6d1e", "\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59\u541b\u610f"},
		[]string{"\u5916\u4ea4\u90e8", "\u53d1\u8a00\u4eba", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc\u4eba", "\u4f1a\u8bae", "\u548c", "\u7b2c\u56db\u5c4a", "\u4e1c\u4e9a", "\u5cf0\u4f1a"},
		[]string{"\u5728", "\u8fc7\u53bb", "\u7684", "\u8fd9", "\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74", "\u9996\u90fd", "\u9605\u5175"},
		[]string{"\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u6765", "\u4e16\u535a\u56ed"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u53bb", "\u4e16\u535a\u56ed"},
		[]string{"\u4f46\u662f", "\u540e\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", " ", "love", "\u4f60", "\uff0c", "\u4e0d\u4ee5\u4e3a\u803b", "\uff0c", "\u53cd", "\u4ee5\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e3a\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u662f", "\u4e3a\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{",", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u662f\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3\u90e8", "\u8499\u4eba", "\u7684", "\u95f2\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9\u5012", "\uff01", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "\u65e5", "\uff0c", "\u5168\u56fd\u4eba\u5927\u5e38\u59d4\u4f1a", "\u7b2c\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743", "\u8d23\u4efb\u6cd5", "\u8349\u6848", "\uff0c", "\u5220\u9664", "\u4e86", "\u6709\u5173", "\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "\u201c", "\u4e3e\u8bc1", "\u5012\u7f6e", "\u201d", "\u7684", "\u89c4\u5b9a", "\u3002", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39\u8005", "\u7531\u6b64", "\u5c06", "\u9677\u5165", "\u4e07\u52ab\u4e0d\u590d", "\u7684", "\u5883\u5730", "\u3002", " "},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684", "\u786e\u5b9e", "\u5728\u7406"},
		[]string{"\u957f\u6625", "\u5e02\u957f", "\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c", "\u5c1a\u672a", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408", "\u6210", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c", "\u670d\u52a1", "\u662f", "\u6700\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684\u786e", "\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b", "\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03", "\u584c\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3\u5904"},
		[]string{"\u90a2\u6c38\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0", "\u533a\u5206\u5ea6", "\uff1f"},
		[]string{"\u5357\u4eac\u5e02", "\u957f\u6c5f\u5927\u6865"},
		[]string{"\u5e94", "\u4e00\u4e9b", "\u4f7f\u7528\u8005", "\u7684", "\u5efa\u8bae", "\uff0c", "\u4e5f", "\u4e3a\u4e86", "\u4fbf\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625\u5e02", "\u957f\u6625", "\u836f\u5e97"},
		[]string{"\u9093\u9896\u8d85", "\u751f\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u80e1\u9526\u6d9b", "\u662f", "\u70ed\u7231", "\u4e16\u754c", "\u548c\u5e73", "\u7684", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f\u5458", "\u795d", "\u6d77\u6797", "\u548c", "\u6731\u4f1a\u9707", "\u662f", "\u5728", "\u5b59\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", ",", " ", "\u8303\u51ef", "\u5728", "\u6700", "\u53f3\u9762", ".", "\u518d\u5f80", "\u5de6", "\u662f", "\u674e\u677e\u6d2a"},
		[]string{"\u4e00\u6b21\u6027", "\u4ea4", "\u591a\u5c11", "\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94", "\u4e00\u5957", "\uff0c", "\u4e09\u5757", "\u516b", "\u4e00\u65a4", "\uff0c", "\u56db\u5757", "\u4e03", "\u4e00\u672c", "\uff0c", "\u4e94\u5757", "\u516d", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c\u5c1a", "\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c\u5c1a", "\u4e00\u6837", "\u7684", "\u548c\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u516c\u6c11", ";", "\u6211", "\u7238\u7238", "\u662f", "\u5171\u548c\u515a", "\u515a\u5458", ";", " ", "\u5730\u94c1", "\u548c\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11", "\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B\u8d85", "\u7136\u540e", "\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T\u6064"},
		[]string{"AT&T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "\uff0c", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "\uff1f"},
		[]string{"C++", "\u548c", "c#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "\uff1f", "11", "+", "122", "=", "133", "\uff0c", "\u662f", "\u5417", "\uff1f", "PI", "=", "3.14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d", "\u63e1\u624b", "\u7684", "\u7684\u54e5", "\u5417", "\uff1f", "\u4ed6\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684\u58eb", "\u3002"},
		[]string{"\u67aa\u6746\u5b50", "\u4e2d", "\u51fa", "\u653f\u6743"},
	}

	cutAllResult = [][]string{
		[]string{"\u8fd9", "\u662f", "\u4e00\u4e2a", "\u4f38\u624b", "\u4f38\u624b\u4e0d\u89c1", "\u4f38\u624b\u4e0d\u89c1\u4e94\u6307", "\u4e0d\u89c1", "\u4e94\u6307", "\u7684", "\u9ed1\u591c", "", "", "\u6211", "\u53eb", "\u5b59\u609f\u7a7a", "\u609f\u7a7a", "", "", "\u6211", "\u7231", "\u5317\u4eac", "", "", "\u6211", "\u7231", "Python", "\u548c", "C++", ""},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c\u670d", "", ""},
		[]string{"\u96f7\u7334", "\u56de\u5f52", "\u4eba\u95f4", "", ""},
		[]string{"\u5de5\u4fe1\u5904", "\u5904\u5973", "\u5973\u5e72\u4e8b", "\u5e72\u4e8b", "\u6bcf\u6708", "\u6708\u7ecf", "\u7ecf\u8fc7", "\u4e0b\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u53e3\u4ea4", "\u4ea4\u4ee3", "24", "\u53e3\u4ea4", "\u4ea4\u6362", "\u4ea4\u6362\u673a", "\u6362\u673a", "\u7b49", "\u6280\u672f", "\u6280\u672f\u6027", "\u6027\u5668", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5b89\u88c5\u5de5", "\u88c5\u5de5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df", "\u5ec9\u79df\u623f", "\u79df\u623f"},
		[]string{"\u6c38\u548c", "\u548c\u670d", "\u670d\u88c5", "\u88c5\u9970", "\u88c5\u9970\u54c1", "\u9970\u54c1", "\u6709\u9650", "\u6709\u9650\u516c\u53f8", "\u516c\u53f8"},
		[]string{"\u6211", "\u7231", "\u5317\u4eac", "\u5929\u5b89", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690", "\u9a6c\u5c14\u53ef", "\u9a6c\u5c14\u53ef\u592b", "\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"", "Microsoft", "", "\u4e00", "\u8bcd", "\u7531", "", "MICROcomputer", "", "\u5fae\u578b", "\u8ba1\u7b97", "\u8ba1\u7b97\u673a", "\u7b97\u673a", "", "", "", "\u548c", "", "SOFTware", "", "\u8f6f\u4ef6", "", "", "", "\u4e24\u90e8", "\u90e8\u5206", "\u5206\u7ec4", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5\u9a6c", "\u548c", "\u6b3a", "\u5b9e", "\u9a6c", "\u662f", "\u4eca\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a", "\u85e4", "\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd", "\u4e2d\u56fd\u79d1\u5b66\u9662", "\u4e2d\u56fd\u79d1\u5b66\u9662\u8ba1\u7b97\u6280\u672f\u7814\u7a76\u6240", "\u79d1\u5b66", "\u79d1\u5b66\u9662", "\u5b66\u9662", "\u8ba1\u7b97", "\u8ba1\u7b97\u6280\u672f", "\u6280\u672f", "\u7814\u7a76", "\u7814\u7a76\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211", "\u8d2d\u4e70", "\u4e86", "\u9053\u5177", "\u548c\u670d", "\u670d\u88c5"},
		[]string{"PS", "", "", "\u6211", "\u89c9\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d\u5904", "", "", "\u5c31\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad", "\u4e0d\u65ad\u6539\u8fdb", "\u6539\u8fdb", "", "", "\u907f\u514d", "\u655e", "\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u77f3\u9996", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u5341\u5830", "\u5341\u5830\u5e02"},
		[]string{"\u603b\u7ecf\u7406", "\u7ecf\u7406", "\u7406\u5b8c", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00\u4e86\u767e\u4e86", "\u4e86\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7f8e\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb", "\u521d\u59cb\u5316", "\u5316\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d\u591a", "\u539f\u5b50", "\u7ec4\u7ec7", "\u7ec7\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95", "\u65e0\u5e95\u6d1e", "\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59", "\u541b", "\u610f"},
		[]string{"\u5916\u4ea4", "\u5916\u4ea4\u90e8", "\u90e8\u53d1", "\u53d1\u8a00", "\u53d1\u8a00\u4eba", "\u4eba\u9a6c", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc", "\u9886\u5bfc\u4eba", "\u4f1a\u8bae", "\u8bae\u548c", "\u7b2c\u56db", "\u7b2c\u56db\u5c4a", "\u56db\u5c4a", "\u4e1c\u4e9a", "\u5cf0\u4f1a"},
		[]string{"\u5728", "\u8fc7\u53bb", "\u7684", "\u8fd9", "\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88", "\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74", "\u9996\u90fd", "\u9605\u5175"},
		[]string{"\u4f60\u597d", "\u597d\u4eba", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7f8e\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70", "\u6c34\u679c", "\u679c\u7136", "\u7136\u540e", "\u540e\u6765", "\u6765\u4e16", "\u4e16\u535a", "\u4e16\u535a\u56ed", "\u535a\u56ed"},
		[]string{"\u4e70", "\u6c34\u679c", "\u679c\u7136", "\u7136\u540e", "\u540e\u53bb", "\u53bb\u4e16", "\u4e16\u535a", "\u4e16\u535a\u56ed", "\u535a\u56ed"},
		[]string{"\u4f46\u662f", "\u540e\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", "love", "\u4f60", "", "", "\u4e0d\u4ee5", "\u4e0d\u4ee5\u4e3a\u803b", "\u4ee5\u4e3a", "\u803b", "", "", "\u53cd", "\u4ee5\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60\u597d", "\u597d\u4eba", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7f8e\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u8981\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60\u597d", "\u597d\u4eba", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7f8e\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e3a\u4ec0\u4e48", "\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u56fd\u662f", "\u4e3a\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"", "", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u662f\u56e0\u4e3a", "\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u7d22\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3\u90e8", "\u8499\u4eba", "\u7684", "\u95f2", "\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9\u5012", "", "RT", "", "laoshipukong", "", "", "27", "\u65e5", "", "", "\u5168\u56fd", "\u5168\u56fd\u4eba\u5927", "\u5168\u56fd\u4eba\u5927\u5e38\u59d4\u4f1a", "\u56fd\u4eba", "\u4eba\u5927", "\u4eba\u5927\u5e38\u59d4\u4f1a", "\u5e38\u59d4", "\u5e38\u59d4\u4f1a", "\u59d4\u4f1a", "\u7b2c\u4e09", "\u7b2c\u4e09\u6b21", "\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743", "\u6743\u8d23", "\u8d23\u4efb", "\u8d23\u4efb\u6cd5", "\u8349\u6848", "", "", "\u5220\u9664", "\u9664\u4e86", "\u6709\u5173", "\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "", "", "\u4e3e\u8bc1", "\u5012\u7f6e", "", "", "\u7684", "\u89c4\u5b9a", "", "", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d", "\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39", "\u6d88\u8d39\u8005", "\u7531\u6b64", "\u5c06", "\u9677\u5165", "\u4e07\u52ab\u4e0d\u590d", "\u4e0d\u590d", "\u7684", "\u5883\u5730", "", "", ""},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684\u786e", "\u786e\u5b9e", "\u5b9e\u5728", "\u7406"},
		[]string{"\u957f\u6625", "\u957f\u6625\u5e02", "\u5e02\u957f", "\u957f\u6625", "\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c\u5c1a", "\u5c1a\u672a", "\u672a\u7ed3", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408", "\u5408\u6210", "\u6210\u5206", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c\u670d", "\u670d\u52a1", "\u662f", "\u6700\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684\u786e", "\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b", "\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14", "\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03", "\u584c", "\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3", "\u5165\u53e3\u5904"},
		[]string{"\u90a2", "\u6c38", "\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf", "\u795e\u7ecf\u7f51", "\u795e\u7ecf\u7f51\u7edc", "\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0", "\u52a0\u533a", "\u533a\u5206", "\u533a\u5206\u5ea6", "\u5206\u5ea6", "", ""},
		[]string{"\u5357\u4eac", "\u5357\u4eac\u5e02", "\u4eac\u5e02", "\u5e02\u957f", "\u957f\u6c5f", "\u957f\u6c5f\u5927\u6865", "\u5927\u6865"},
		[]string{"\u5e94", "\u4e00\u4e9b", "\u4f7f\u7528", "\u4f7f\u7528\u8005", "\u7528\u8005", "\u7684", "\u5efa\u8bae", "", "", "\u4e5f", "\u4e3a\u4e86", "\u4fbf\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625", "\u957f\u6625\u5e02", "\u5e02\u957f", "\u957f\u6625", "\u6625\u836f", "\u836f\u5e97"},
		[]string{"\u9093\u9896\u8d85", "\u8d85\u751f", "\u751f\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u80e1\u9526\u6d9b", "\u9526\u6d9b", "\u662f", "\u70ed\u7231", "\u4e16\u754c", "\u548c\u5e73", "\u7684", "\u653f\u6cbb", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f", "\u7a0b\u5e8f\u5458", "\u795d", "\u6d77\u6797", "\u548c", "\u6731", "\u4f1a", "\u9707", "\u662f", "\u5728", "\u5b59", "\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", "", "", "", "\u8303", "\u51ef", "\u5728", "\u6700", "\u53f3\u9762", "", "", "\u518d\u5f80", "\u5de6", "\u662f", "\u674e", "\u677e", "\u6d2a"},
		[]string{"\u4e00\u6b21", "\u4e00\u6b21\u6027", "\u6027\u4ea4", "\u591a\u5c11", "\u591a\u5c11\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94\u4e00", "\u4e00\u5957", "", "", "\u4e09\u5757", "\u516b\u4e00", "\u4e00\u65a4", "", "", "\u56db\u5757", "\u4e03\u4e00", "\u4e00\u672c", "", "", "\u4e94\u5757", "\u516d\u4e00", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c\u5c1a", "\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c\u5c1a", "\u4e00\u6837", "\u7684", "\u548c\u5c1a", "\u548c\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e", "\u4e2d\u534e\u4eba\u6c11", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u534e\u4eba", "\u4eba\u6c11", "\u4eba\u6c11\u5171\u548c\u56fd", "\u5171\u548c", "\u5171\u548c\u56fd", "\u56fd\u516c", "\u516c\u6c11", "", "", "\u6211", "\u7238\u7238", "\u662f", "\u5171\u548c", "\u5171\u548c\u515a", "\u515a\u5458", "", "", "", "\u5730\u94c1", "\u548c\u5e73", "\u548c\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11", "\u6c11\u533b\u9662", "\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B", "\u8d85\u7136", "\u7136\u540e", "\u540e\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T", "\u6064"},
		[]string{"AT", "T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "", "", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "", ""},
		[]string{"C++", "\u548c", "c#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "", "11+122", "133", "", "\u662f", "\u5417", "", "PI", "3", "14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d", "\u63e1\u624b", "\u7684", "\u7684\u54e5", "\u5417", "", "", "\u4ed6", "\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684\u58eb", "", ""},
		[]string{"\u67aa\u6746", "\u67aa\u6746\u5b50", "\u6746\u5b50", "\u4e2d\u51fa", "\u653f\u6743"},
	}

	defaultCutNoHMMResult = [][]string{
		[]string{"\u8fd9", "\u662f", "\u4e00\u4e2a", "\u4f38\u624b\u4e0d\u89c1\u4e94\u6307", "\u7684", "\u9ed1\u591c", "\u3002", "\u6211", "\u53eb", "\u5b59\u609f\u7a7a", "\uff0c", "\u6211", "\u7231", "\u5317\u4eac", "\uff0c", "\u6211", "\u7231", "Python", "\u548c", "C++", "\u3002"},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c\u670d", "\u3002"},
		[]string{"\u96f7\u7334", "\u56de\u5f52", "\u4eba\u95f4", "\u3002"},
		[]string{"\u5de5\u4fe1\u5904", "\u5973\u5e72\u4e8b", "\u6bcf\u6708", "\u7ecf\u8fc7", "\u4e0b\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u4ea4\u4ee3", "24", "\u53e3", "\u4ea4\u6362\u673a", "\u7b49", "\u6280\u672f\u6027", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df\u623f"},
		[]string{"\u6c38\u548c", "\u670d\u88c5", "\u9970\u54c1", "\u6709\u9650\u516c\u53f8"},
		[]string{"\u6211", "\u7231", "\u5317\u4eac", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690", "\u9a6c\u5c14\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"\u201c", "Microsoft", "\u201d", "\u4e00", "\u8bcd", "\u7531", "\u201c", "MICROcomputer", "\uff08", "\u5fae\u578b", "\u8ba1\u7b97\u673a", "\uff09", "\u201d", "\u548c", "\u201c", "SOFTware", "\uff08", "\u8f6f\u4ef6", "\uff09", "\u201d", "\u4e24", "\u90e8\u5206", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5\u9a6c", "\u548c", "\u6b3a", "\u5b9e", "\u9a6c", "\u662f", "\u4eca\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a", "\u85e4", "\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd\u79d1\u5b66\u9662\u8ba1\u7b97\u6280\u672f\u7814\u7a76\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211", "\u8d2d\u4e70", "\u4e86", "\u9053\u5177", "\u548c", "\u670d\u88c5"},
		[]string{"PS", ":", " ", "\u6211", "\u89c9\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d\u5904", "\uff0c", "\u5c31\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad\u6539\u8fdb", "\uff0c", "\u907f\u514d", "\u655e", "\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317\u7701", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317\u7701", "\u5341\u5830\u5e02"},
		[]string{"\u603b\u7ecf\u7406", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00\u4e86\u767e\u4e86", "\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb\u5316", "\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d\u591a", "\u539f\u5b50", "\u7ec4\u7ec7", "\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95\u6d1e", "\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59", "\u541b", "\u610f"},
		[]string{"\u5916\u4ea4\u90e8", "\u53d1\u8a00\u4eba", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc\u4eba", "\u4f1a\u8bae", "\u548c", "\u7b2c\u56db\u5c4a", "\u4e1c\u4e9a", "\u5cf0\u4f1a"},
		[]string{"\u5728", "\u8fc7\u53bb", "\u7684", "\u8fd9", "\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88", "\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74", "\u9996\u90fd", "\u9605\u5175"},
		[]string{"\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u6765", "\u4e16\u535a\u56ed"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u53bb", "\u4e16\u535a\u56ed"},
		[]string{"\u4f46\u662f", "\u540e\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", " ", "love", "\u4f60", "\uff0c", "\u4e0d\u4ee5\u4e3a\u803b", "\uff0c", "\u53cd", "\u4ee5\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e3a\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u662f", "\u4e3a\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{",", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u662f\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3", "\u90e8", "\u8499", "\u4eba", "\u7684", "\u95f2", "\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9\u5012", "\uff01", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "\u65e5", "\uff0c", "\u5168\u56fd\u4eba\u5927\u5e38\u59d4\u4f1a", "\u7b2c\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743", "\u8d23\u4efb\u6cd5", "\u8349\u6848", "\uff0c", "\u5220\u9664", "\u4e86", "\u6709\u5173", "\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "\u201c", "\u4e3e\u8bc1", "\u5012\u7f6e", "\u201d", "\u7684", "\u89c4\u5b9a", "\u3002", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d", "\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39\u8005", "\u7531\u6b64", "\u5c06", "\u9677\u5165", "\u4e07\u52ab\u4e0d\u590d", "\u7684", "\u5883\u5730", "\u3002", " "},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684", "\u786e\u5b9e", "\u5728", "\u7406"},
		[]string{"\u957f\u6625", "\u5e02\u957f", "\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c", "\u5c1a\u672a", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408", "\u6210", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c", "\u670d\u52a1", "\u662f", "\u6700\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684\u786e", "\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b", "\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03", "\u584c", "\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3\u5904"},
		[]string{"\u90a2", "\u6c38", "\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0", "\u533a\u5206\u5ea6", "\uff1f"},
		[]string{"\u5357\u4eac\u5e02", "\u957f\u6c5f\u5927\u6865"},
		[]string{"\u5e94", "\u4e00\u4e9b", "\u4f7f\u7528\u8005", "\u7684", "\u5efa\u8bae", "\uff0c", "\u4e5f", "\u4e3a\u4e86", "\u4fbf\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625\u5e02", "\u957f\u6625", "\u836f\u5e97"},
		[]string{"\u9093\u9896\u8d85", "\u751f\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u80e1\u9526\u6d9b", "\u662f", "\u70ed\u7231", "\u4e16\u754c", "\u548c\u5e73", "\u7684", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f\u5458", "\u795d", "\u6d77\u6797", "\u548c", "\u6731", "\u4f1a", "\u9707", "\u662f", "\u5728", "\u5b59", "\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", ",", " ", "\u8303", "\u51ef", "\u5728", "\u6700", "\u53f3\u9762", ".", "\u518d", "\u5f80", "\u5de6", "\u662f", "\u674e", "\u677e", "\u6d2a"},
		[]string{"\u4e00\u6b21\u6027", "\u4ea4", "\u591a\u5c11", "\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94", "\u4e00\u5957", "\uff0c", "\u4e09\u5757", "\u516b", "\u4e00\u65a4", "\uff0c", "\u56db\u5757", "\u4e03", "\u4e00\u672c", "\uff0c", "\u4e94\u5757", "\u516d", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c\u5c1a", "\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c\u5c1a", "\u4e00\u6837", "\u7684", "\u548c\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u516c\u6c11", ";", "\u6211", "\u7238\u7238", "\u662f", "\u5171\u548c\u515a", "\u515a\u5458", ";", " ", "\u5730\u94c1", "\u548c\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11", "\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B\u8d85", "\u7136\u540e", "\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T\u6064"},
		[]string{"AT&T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "\uff0c", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "\uff1f"},
		[]string{"C++", "\u548c", "c#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "\uff1f", "11", "+", "122", "=", "133", "\uff0c", "\u662f", "\u5417", "\uff1f", "PI", "=", "3", ".", "14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d", "\u63e1\u624b", "\u7684", "\u7684\u54e5", "\u5417", "\uff1f", "\u4ed6", "\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684\u58eb", "\u3002"},
		[]string{"\u67aa\u6746\u5b50", "\u4e2d", "\u51fa", "\u653f\u6743"},
	}

	cutForSearchResult = [][]string{
		[]string{"\u8fd9\u662f", "\u4e00\u4e2a", "\u4f38\u624b", "\u4e0d\u89c1", "\u4e94\u6307", "\u4f38\u624b\u4e0d\u89c1\u4e94\u6307", "\u7684", "\u9ed1\u591c", "\u3002", "\u6211", "\u53eb", "\u609f\u7a7a", "\u5b59\u609f\u7a7a", "\uff0c", "\u6211", "\u7231", "\u5317\u4eac", "\uff0c", "\u6211", "\u7231", "Python", "\u548c", "C++", "\u3002"},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c\u670d", "\u3002"},
		[]string{"\u96f7\u7334", "\u56de\u5f52", "\u4eba\u95f4", "\u3002"},
		[]string{"\u5de5\u4fe1\u5904", "\u5e72\u4e8b", "\u5973\u5e72\u4e8b", "\u6bcf\u6708", "\u7ecf\u8fc7", "\u4e0b\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u4ea4\u4ee3", "24", "\u53e3", "\u4ea4\u6362", "\u6362\u673a", "\u4ea4\u6362\u673a", "\u7b49", "\u6280\u672f", "\u6280\u672f\u6027", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df", "\u79df\u623f", "\u5ec9\u79df\u623f"},
		[]string{"\u6c38\u548c", "\u670d\u88c5", "\u9970\u54c1", "\u6709\u9650", "\u516c\u53f8", "\u6709\u9650\u516c\u53f8"},
		[]string{"\u6211", "\u7231", "\u5317\u4eac", "\u5929\u5b89", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690", "\u53ef\u592b", "\u9a6c\u5c14\u53ef", "\u9a6c\u5c14\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"\u201c", "Microsoft", "\u201d", "\u4e00\u8bcd", "\u7531", "\u201c", "MICROcomputer", "\uff08", "\u5fae\u578b", "\u8ba1\u7b97", "\u7b97\u673a", "\u8ba1\u7b97\u673a", "\uff09", "\u201d", "\u548c", "\u201c", "SOFTware", "\uff08", "\u8f6f\u4ef6", "\uff09", "\u201d", "\u4e24", "\u90e8\u5206", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5\u9a6c", "\u548c", "\u6b3a\u5b9e", "\u9a6c", "\u662f", "\u4eca\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a\u85e4", "\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd", "\u79d1\u5b66", "\u5b66\u9662", "\u8ba1\u7b97", "\u6280\u672f", "\u7814\u7a76", "\u79d1\u5b66\u9662", "\u7814\u7a76\u6240", "\u4e2d\u56fd\u79d1\u5b66\u9662\u8ba1\u7b97\u6280\u672f\u7814\u7a76\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211", "\u8d2d\u4e70", "\u4e86", "\u9053\u5177", "\u548c", "\u670d\u88c5"},
		[]string{"PS", ":", " ", "\u6211", "\u89c9\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d\u5904", "\uff0c", "\u5c31\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad", "\u6539\u8fdb", "\u4e0d\u65ad\u6539\u8fdb", "\uff0c", "\u907f\u514d", "\u655e\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u77f3\u9996", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u5341\u5830", "\u5341\u5830\u5e02"},
		[]string{"\u7ecf\u7406", "\u603b\u7ecf\u7406", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00\u4e86\u767e\u4e86", "\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb", "\u521d\u59cb\u5316", "\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d\u591a", "\u539f\u5b50", "\u7ec4\u7ec7", "\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95", "\u65e0\u5e95\u6d1e", "\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59\u541b\u610f"},
		[]string{"\u5916\u4ea4", "\u5916\u4ea4\u90e8", "\u53d1\u8a00", "\u53d1\u8a00\u4eba", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc", "\u9886\u5bfc\u4eba", "\u4f1a\u8bae", "\u548c", "\u7b2c\u56db", "\u56db\u5c4a", "\u7b2c\u56db\u5c4a", "\u4e1c\u4e9a", "\u5cf0\u4f1a"},
		[]string{"\u5728", "\u8fc7\u53bb", "\u7684", "\u8fd9", "\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74", "\u9996\u90fd", "\u9605\u5175"},
		[]string{"\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u6765", "\u4e16\u535a", "\u535a\u56ed", "\u4e16\u535a\u56ed"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u53bb", "\u4e16\u535a", "\u535a\u56ed", "\u4e16\u535a\u56ed"},
		[]string{"\u4f46\u662f", "\u540e\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", " ", "love", "\u4f60", "\uff0c", "\u4e0d\u4ee5", "\u4ee5\u4e3a", "\u4e0d\u4ee5\u4e3a\u803b", "\uff0c", "\u53cd", "\u4ee5\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4ec0\u4e48", "\u4e3a\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u662f", "\u4e3a\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{",", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u56e0\u4e3a", "\u662f\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3\u90e8", "\u8499\u4eba", "\u7684", "\u95f2\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9\u5012", "\uff01", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "\u65e5", "\uff0c", "\u5168\u56fd", "\u56fd\u4eba", "\u4eba\u5927", "\u5e38\u59d4", "\u59d4\u4f1a", "\u5e38\u59d4\u4f1a", "\u5168\u56fd\u4eba\u5927\u5e38\u59d4\u4f1a", "\u7b2c\u4e09", "\u4e09\u6b21", "\u7b2c\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743", "\u8d23\u4efb", "\u8d23\u4efb\u6cd5", "\u8349\u6848", "\uff0c", "\u5220\u9664", "\u4e86", "\u6709\u5173", "\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "\u201c", "\u4e3e\u8bc1", "\u5012\u7f6e", "\u201d", "\u7684", "\u89c4\u5b9a", "\u3002", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39", "\u6d88\u8d39\u8005", "\u7531\u6b64", "\u5c06", "\u9677\u5165", "\u4e0d\u590d", "\u4e07\u52ab\u4e0d\u590d", "\u7684", "\u5883\u5730", "\u3002", " "},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684", "\u786e\u5b9e", "\u5728\u7406"},
		[]string{"\u957f\u6625", "\u5e02\u957f", "\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c", "\u5c1a\u672a", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408", "\u6210", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c", "\u670d\u52a1", "\u662f", "\u6700\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684\u786e", "\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b", "\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14", "\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03", "\u584c\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3", "\u5165\u53e3\u5904"},
		[]string{"\u90a2\u6c38\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf", "\u7f51\u7edc", "\u795e\u7ecf\u7f51", "\u795e\u7ecf\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0", "\u533a\u5206", "\u5206\u5ea6", "\u533a\u5206\u5ea6", "\uff1f"},
		[]string{"\u5357\u4eac", "\u4eac\u5e02", "\u5357\u4eac\u5e02", "\u957f\u6c5f", "\u5927\u6865", "\u957f\u6c5f\u5927\u6865"},
		[]string{"\u5e94", "\u4e00\u4e9b", "\u4f7f\u7528", "\u7528\u8005", "\u4f7f\u7528\u8005", "\u7684", "\u5efa\u8bae", "\uff0c", "\u4e5f", "\u4e3a\u4e86", "\u4fbf\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625", "\u957f\u6625\u5e02", "\u957f\u6625", "\u836f\u5e97"},
		[]string{"\u9093\u9896\u8d85", "\u751f\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u9526\u6d9b", "\u80e1\u9526\u6d9b", "\u662f", "\u70ed\u7231", "\u4e16\u754c", "\u548c\u5e73", "\u7684", "\u653f\u6cbb", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f", "\u7a0b\u5e8f\u5458", "\u795d", "\u6d77\u6797", "\u548c", "\u6731\u4f1a\u9707", "\u662f", "\u5728", "\u5b59\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", ",", " ", "\u8303\u51ef", "\u5728", "\u6700", "\u53f3\u9762", ".", "\u518d\u5f80", "\u5de6", "\u662f", "\u674e\u677e\u6d2a"},
		[]string{"\u4e00\u6b21", "\u4e00\u6b21\u6027", "\u4ea4", "\u591a\u5c11", "\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94", "\u4e00\u5957", "\uff0c", "\u4e09\u5757", "\u516b", "\u4e00\u65a4", "\uff0c", "\u56db\u5757", "\u4e03", "\u4e00\u672c", "\uff0c", "\u4e94\u5757", "\u516d", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c\u5c1a", "\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c\u5c1a", "\u4e00\u6837", "\u7684", "\u548c\u5c1a", "\u548c\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e", "\u534e\u4eba", "\u4eba\u6c11", "\u5171\u548c", "\u5171\u548c\u56fd", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u516c\u6c11", ";", "\u6211", "\u7238\u7238", "\u662f", "\u5171\u548c", "\u5171\u548c\u515a", "\u515a\u5458", ";", " ", "\u5730\u94c1", "\u548c\u5e73", "\u548c\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11", "\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B\u8d85", "\u7136\u540e", "\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T\u6064"},
		[]string{"AT&T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "\uff0c", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "\uff1f"},
		[]string{"C++", "\u548c", "c#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "\uff1f", "11", "+", "122", "=", "133", "\uff0c", "\u662f", "\u5417", "\uff1f", "PI", "=", "3.14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d", "\u63e1\u624b", "\u7684", "\u7684\u54e5", "\u5417", "\uff1f", "\u4ed6\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684\u58eb", "\u3002"},
		[]string{"\u67aa\u6746", "\u6746\u5b50", "\u67aa\u6746\u5b50", "\u4e2d", "\u51fa", "\u653f\u6743"},
	}

	cutForSearchNoHMMResult = [][]string{
		[]string{"\u8fd9", "\u662f", "\u4e00\u4e2a", "\u4f38\u624b", "\u4e0d\u89c1", "\u4e94\u6307", "\u4f38\u624b\u4e0d\u89c1\u4e94\u6307", "\u7684", "\u9ed1\u591c", "\u3002", "\u6211", "\u53eb", "\u609f\u7a7a", "\u5b59\u609f\u7a7a", "\uff0c", "\u6211", "\u7231", "\u5317\u4eac", "\uff0c", "\u6211", "\u7231", "Python", "\u548c", "C++", "\u3002"},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c\u670d", "\u3002"},
		[]string{"\u96f7\u7334", "\u56de\u5f52", "\u4eba\u95f4", "\u3002"},
		[]string{"\u5de5\u4fe1\u5904", "\u5e72\u4e8b", "\u5973\u5e72\u4e8b", "\u6bcf\u6708", "\u7ecf\u8fc7", "\u4e0b\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u4ea4\u4ee3", "24", "\u53e3", "\u4ea4\u6362", "\u6362\u673a", "\u4ea4\u6362\u673a", "\u7b49", "\u6280\u672f", "\u6280\u672f\u6027", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df", "\u79df\u623f", "\u5ec9\u79df\u623f"},
		[]string{"\u6c38\u548c", "\u670d\u88c5", "\u9970\u54c1", "\u6709\u9650", "\u516c\u53f8", "\u6709\u9650\u516c\u53f8"},
		[]string{"\u6211", "\u7231", "\u5317\u4eac", "\u5929\u5b89", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690", "\u53ef\u592b", "\u9a6c\u5c14\u53ef", "\u9a6c\u5c14\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"\u201c", "Microsoft", "\u201d", "\u4e00", "\u8bcd", "\u7531", "\u201c", "MICROcomputer", "\uff08", "\u5fae\u578b", "\u8ba1\u7b97", "\u7b97\u673a", "\u8ba1\u7b97\u673a", "\uff09", "\u201d", "\u548c", "\u201c", "SOFTware", "\uff08", "\u8f6f\u4ef6", "\uff09", "\u201d", "\u4e24", "\u90e8\u5206", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5\u9a6c", "\u548c", "\u6b3a", "\u5b9e", "\u9a6c", "\u662f", "\u4eca\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a", "\u85e4", "\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd", "\u79d1\u5b66", "\u5b66\u9662", "\u8ba1\u7b97", "\u6280\u672f", "\u7814\u7a76", "\u79d1\u5b66\u9662", "\u7814\u7a76\u6240", "\u4e2d\u56fd\u79d1\u5b66\u9662\u8ba1\u7b97\u6280\u672f\u7814\u7a76\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211", "\u8d2d\u4e70", "\u4e86", "\u9053\u5177", "\u548c", "\u670d\u88c5"},
		[]string{"PS", ":", " ", "\u6211", "\u89c9\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d\u5904", "\uff0c", "\u5c31\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad", "\u6539\u8fdb", "\u4e0d\u65ad\u6539\u8fdb", "\uff0c", "\u907f\u514d", "\u655e", "\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u77f3\u9996", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317", "\u6e56\u5317\u7701", "\u5341\u5830", "\u5341\u5830\u5e02"},
		[]string{"\u7ecf\u7406", "\u603b\u7ecf\u7406", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00\u4e86\u767e\u4e86", "\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb", "\u521d\u59cb\u5316", "\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d\u591a", "\u539f\u5b50", "\u7ec4\u7ec7", "\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95", "\u65e0\u5e95\u6d1e", "\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59", "\u541b", "\u610f"},
		[]string{"\u5916\u4ea4", "\u5916\u4ea4\u90e8", "\u53d1\u8a00", "\u53d1\u8a00\u4eba", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc", "\u9886\u5bfc\u4eba", "\u4f1a\u8bae", "\u548c", "\u7b2c\u56db", "\u56db\u5c4a", "\u7b2c\u56db\u5c4a", "\u4e1c\u4e9a", "\u5cf0\u4f1a"},
		[]string{"\u5728", "\u8fc7\u53bb", "\u7684", "\u8fd9", "\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88", "\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74", "\u9996\u90fd", "\u9605\u5175"},
		[]string{"\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u6765", "\u4e16\u535a", "\u535a\u56ed", "\u4e16\u535a\u56ed"},
		[]string{"\u4e70", "\u6c34\u679c", "\u7136\u540e", "\u53bb", "\u4e16\u535a", "\u535a\u56ed", "\u4e16\u535a\u56ed"},
		[]string{"\u4f46\u662f", "\u540e\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", " ", "love", "\u4f60", "\uff0c", "\u4e0d\u4ee5", "\u4ee5\u4e3a", "\u4e0d\u4ee5\u4e3a\u803b", "\uff0c", "\u53cd", "\u4ee5\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60\u597d", "\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4ec0\u4e48", "\u4e3a\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u662f", "\u4e3a\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{",", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u56e0\u4e3a", "\u662f\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3", "\u90e8", "\u8499", "\u4eba", "\u7684", "\u95f2", "\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9\u5012", "\uff01", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "\u65e5", "\uff0c", "\u5168\u56fd", "\u56fd\u4eba", "\u4eba\u5927", "\u5e38\u59d4", "\u59d4\u4f1a", "\u5e38\u59d4\u4f1a", "\u5168\u56fd\u4eba\u5927\u5e38\u59d4\u4f1a", "\u7b2c\u4e09", "\u4e09\u6b21", "\u7b2c\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743", "\u8d23\u4efb", "\u8d23\u4efb\u6cd5", "\u8349\u6848", "\uff0c", "\u5220\u9664", "\u4e86", "\u6709\u5173", "\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "\u201c", "\u4e3e\u8bc1", "\u5012\u7f6e", "\u201d", "\u7684", "\u89c4\u5b9a", "\u3002", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d", "\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39", "\u6d88\u8d39\u8005", "\u7531\u6b64", "\u5c06", "\u9677\u5165", "\u4e0d\u590d", "\u4e07\u52ab\u4e0d\u590d", "\u7684", "\u5883\u5730", "\u3002", " "},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684", "\u786e\u5b9e", "\u5728", "\u7406"},
		[]string{"\u957f\u6625", "\u5e02\u957f", "\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c", "\u5c1a\u672a", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408", "\u6210", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c", "\u670d\u52a1", "\u662f", "\u6700\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684\u786e", "\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b", "\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14", "\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03", "\u584c", "\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3", "\u5165\u53e3\u5904"},
		[]string{"\u90a2", "\u6c38", "\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf", "\u7f51\u7edc", "\u795e\u7ecf\u7f51", "\u795e\u7ecf\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0", "\u533a\u5206", "\u5206\u5ea6", "\u533a\u5206\u5ea6", "\uff1f"},
		[]string{"\u5357\u4eac", "\u4eac\u5e02", "\u5357\u4eac\u5e02", "\u957f\u6c5f", "\u5927\u6865", "\u957f\u6c5f\u5927\u6865"},
		[]string{"\u5e94", "\u4e00\u4e9b", "\u4f7f\u7528", "\u7528\u8005", "\u4f7f\u7528\u8005", "\u7684", "\u5efa\u8bae", "\uff0c", "\u4e5f", "\u4e3a\u4e86", "\u4fbf\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625", "\u957f\u6625\u5e02", "\u957f\u6625", "\u836f\u5e97"},
		[]string{"\u9093\u9896\u8d85", "\u751f\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u9526\u6d9b", "\u80e1\u9526\u6d9b", "\u662f", "\u70ed\u7231", "\u4e16\u754c", "\u548c\u5e73", "\u7684", "\u653f\u6cbb", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f", "\u7a0b\u5e8f\u5458", "\u795d", "\u6d77\u6797", "\u548c", "\u6731", "\u4f1a", "\u9707", "\u662f", "\u5728", "\u5b59", "\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", ",", " ", "\u8303", "\u51ef", "\u5728", "\u6700", "\u53f3\u9762", ".", "\u518d", "\u5f80", "\u5de6", "\u662f", "\u674e", "\u677e", "\u6d2a"},
		[]string{"\u4e00\u6b21", "\u4e00\u6b21\u6027", "\u4ea4", "\u591a\u5c11", "\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94", "\u4e00\u5957", "\uff0c", "\u4e09\u5757", "\u516b", "\u4e00\u65a4", "\uff0c", "\u56db\u5757", "\u4e03", "\u4e00\u672c", "\uff0c", "\u4e94\u5757", "\u516d", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c\u5c1a", "\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c\u5c1a", "\u4e00\u6837", "\u7684", "\u548c\u5c1a", "\u548c\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e", "\u534e\u4eba", "\u4eba\u6c11", "\u5171\u548c", "\u5171\u548c\u56fd", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u516c\u6c11", ";", "\u6211", "\u7238\u7238", "\u662f", "\u5171\u548c", "\u5171\u548c\u515a", "\u515a\u5458", ";", " ", "\u5730\u94c1", "\u548c\u5e73", "\u548c\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11", "\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B\u8d85", "\u7136\u540e", "\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T\u6064"},
		[]string{"AT&T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "\uff0c", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "\uff1f"},
		[]string{"C++", "\u548c", "c#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "\uff1f", "11", "+", "122", "=", "133", "\uff0c", "\u662f", "\u5417", "\uff1f", "PI", "=", "3", ".", "14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d", "\u63e1\u624b", "\u7684", "\u7684\u54e5", "\u5417", "\uff1f", "\u4ed6", "\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684\u58eb", "\u3002"},
		[]string{"\u67aa\u6746", "\u6746\u5b50", "\u67aa\u6746\u5b50", "\u4e2d", "\u51fa", "\u653f\u6743"},
	}

	userDictCutResult = [][]string{
		[]string{"\u8fd9\u662f", "\u4e00\u4e2a", "\u4f38\u624b", "\u4e0d\u89c1", "\u4e94\u6307", "\u7684", "\u9ed1\u591c", "\u3002", "\u6211", "\u53eb", "\u5b59\u609f\u7a7a", "\uff0c", "\u6211", "\u7231\u5317\u4eac", "\uff0c", "\u6211", "\u7231", "Python", "\u548c", "C", "++", "\u3002"},
		[]string{"\u6211", "\u4e0d", "\u559c\u6b22", "\u65e5\u672c", "\u548c", "\u670d", "\u3002"},
		[]string{"\u96f7\u7334", "\u56de\u5f52\u4eba\u95f4", "\u3002"},
		[]string{"\u5de5\u4fe1", "\u5904\u5973", "\u5e72\u4e8b", "\u6bcf", "\u6708", "\u7ecf\u8fc7", "\u4e0b", "\u5c5e", "\u79d1\u5ba4", "\u90fd", "\u8981", "\u4eb2\u53e3", "\u4ea4\u4ee3", "24", "\u53e3\u4ea4\u6362\u673a", "\u7b49", "\u6280\u672f\u6027", "\u5668\u4ef6", "\u7684", "\u5b89\u88c5", "\u5de5\u4f5c"},
		[]string{"\u6211", "\u9700\u8981", "\u5ec9\u79df\u623f"},
		[]string{"\u6c38\u548c\u670d", "\u88c5\u9970\u54c1", "\u6709", "\u9650\u516c\u53f8"},
		[]string{"\u6211", "\u7231\u5317\u4eac", "\u5929\u5b89\u95e8"},
		[]string{"abc"},
		[]string{"\u9690\u9a6c\u5c14", "\u53ef\u592b"},
		[]string{"\u96f7\u7334", "\u662f", "\u4e2a", "\u597d", "\u7f51\u7ad9"},
		[]string{"\u201c", "Microsoft", "\u201d", "\u4e00\u8bcd", "\u7531", "\u201c", "MICROcomputer", "\uff08", "\u5fae\u578b", "\u8ba1\u7b97\u673a", "\uff09", "\u201d", "\u548c", "\u201c", "SOFTware", "\uff08", "\u8f6f\u4ef6", "\uff09", "\u201d", "\u4e24\u90e8\u5206", "\u7ec4\u6210"},
		[]string{"\u8349\u6ce5", "\u9a6c", "\u548c", "\u6b3a\u5b9e", "\u9a6c", "\u662f", "\u4eca", "\u5e74", "\u7684", "\u6d41\u884c", "\u8bcd\u6c47"},
		[]string{"\u4f0a\u85e4\u6d0b\u534e\u5802", "\u603b\u5e9c", "\u5e97"},
		[]string{"\u4e2d\u56fd", "\u79d1\u5b66\u9662", "\u8ba1\u7b97", "\u6280\u672f", "\u7814\u7a76", "\u6240"},
		[]string{"\u7f57\u5bc6\u6b27", "\u4e0e", "\u6731\u4e3d\u53f6"},
		[]string{"\u6211\u8d2d", "\u4e70", "\u4e86", "\u9053", "\u5177", "\u548c", "\u670d\u88c5"},
		[]string{"PS", ":", " ", "\u6211\u89c9", "\u5f97", "\u5f00\u6e90", "\u6709", "\u4e00\u4e2a", "\u597d", "\u5904", "\uff0c", "\u5c31", "\u662f", "\u80fd\u591f", "\u6566\u4fc3", "\u81ea\u5df1", "\u4e0d\u65ad", "\u6539\u8fdb", "\uff0c", "\u907f\u514d", "\u655e\u5e1a", "\u81ea\u73cd"},
		[]string{"\u6e56\u5317\u7701", "\u77f3\u9996\u5e02"},
		[]string{"\u6e56\u5317\u7701", "\u5341\u5830\u5e02"},
		[]string{"\u603b\u7ecf\u7406", "\u5b8c\u6210", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5"},
		[]string{"\u7535\u8111", "\u4fee\u597d", "\u4e86"},
		[]string{"\u505a", "\u597d", "\u4e86", "\u8fd9\u4ef6", "\u4e8b\u60c5", "\u5c31", "\u4e00", "\u4e86", "\u767e", "\u4e86", "\u4e86"},
		[]string{"\u4eba\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u6211\u4eec", "\u4e70", "\u4e86", "\u4e00\u4e2a", "\u7f8e", "\u7684", "\u7a7a\u8c03"},
		[]string{"\u7ebf\u7a0b", "\u521d\u59cb", "\u5316\u65f6", "\u6211\u4eec", "\u8981", "\u6ce8\u610f"},
		[]string{"\u4e00\u4e2a", "\u5206\u5b50", "\u662f", "\u7531", "\u597d", "\u591a", "\u539f\u5b50", "\u7ec4\u7ec7\u6210", "\u7684"},
		[]string{"\u795d", "\u4f60", "\u9a6c\u5230", "\u529f\u6210"},
		[]string{"\u4ed6", "\u6389", "\u8fdb", "\u4e86", "\u65e0\u5e95", "\u6d1e\u91cc"},
		[]string{"\u4e2d\u56fd", "\u7684", "\u9996", "\u90fd", "\u662f", "\u5317\u4eac"},
		[]string{"\u5b59\u541b\u610f"},
		[]string{"\u5916\u4ea4\u90e8", "\u53d1\u8a00\u4eba", "\u9a6c\u671d\u65ed"},
		[]string{"\u9886\u5bfc", "\u4eba\u4f1a\u8bae", "\u548c", "\u7b2c\u56db\u5c4a", "\u4e1c\u4e9a\u5cf0", "\u4f1a"},
		[]string{"\u5728", "\u8fc7", "\u53bb", "\u7684", "\u8fd9\u4e94\u5e74"},
		[]string{"\u8fd8", "\u9700\u8981", "\u5f88\u957f", "\u7684", "\u8def", "\u8981", "\u8d70"},
		[]string{"60", "\u5468\u5e74\u9996", "\u90fd", "\u9605\u5175"},
		[]string{"\u4f60", "\u597d\u4eba", "\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e70\u6c34\u679c", "\u7136\u540e", "\u6765", "\u4e16\u535a\u56ed"},
		[]string{"\u4e70\u6c34\u679c", "\u7136\u540e", "\u53bb", "\u4e16\u535a\u56ed"},
		[]string{"\u4f46", "\u662f", "\u540e", "\u6765", "\u6211", "\u624d", "\u77e5\u9053", "\u4f60", "\u662f", "\u5bf9", "\u7684"},
		[]string{"\u5b58\u5728", "\u5373", "\u5408\u7406"},
		[]string{"\u7684", "\u7684", "\u7684", "\u7684", "\u7684", "\u5728", "\u7684", "\u7684", "\u7684", "\u7684", "\u5c31", "\u4ee5", "\u548c", "\u548c", "\u548c"},
		[]string{"I", " ", "love", "\u4f60", "\uff0c", "\u4e0d\u4ee5", "\u4e3a\u803b", "\uff0c", "\u53cd\u4ee5", "\u4e3a", "rong"},
		[]string{"\u56e0"},
		[]string{},
		[]string{"hello", "\u4f60", "\u597d\u4eba", "\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u5f88", "\u597d", "\u4f46", "\u4e3b\u8981", "\u662f", "\u57fa\u4e8e", "\u7f51\u9875", "\u5f62\u5f0f"},
		[]string{"hello", "\u4f60", "\u597d\u4eba", "\u4eec", "\u5ba1\u7f8e", "\u7684", "\u89c2\u70b9", "\u662f", "\u4e0d\u540c", "\u7684"},
		[]string{"\u4e3a", "\u4ec0\u4e48", "\u6211", "\u4e0d\u80fd", "\u62e5\u6709", "\u60f3", "\u8981", "\u7684", "\u751f\u6d3b"},
		[]string{"\u540e\u6765", "\u6211", "\u624d"},
		[]string{"\u6b64\u6b21", "\u6765", "\u4e2d\u56fd", "\u662f", "\u4e3a", "\u4e86"},
		[]string{"\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{",", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u5176\u5b9e", "\u4f7f", "\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u597d\u4eba", "\u4f7f\u7528", "\u4e86", "\u5b83", "\u5c31", "\u53ef\u4ee5", "\u89e3\u51b3", "\u4e00\u4e9b", "\u95ee\u9898"},
		[]string{"\u662f", "\u56e0\u4e3a", "\u548c", "\u56fd\u5bb6"},
		[]string{"\u8001\u5e74", "\u641c\u7d22", "\u8fd8", "\u652f\u6301"},
		[]string{"\u5e72\u8106", "\u5c31", "\u628a", "\u90a3\u90e8", "\u8499\u4eba", "\u7684", "\u95f2\u6cd5", "\u7ed9", "\u5e9f", "\u4e86", "\u62c9", "\u5012", "\uff01", "RT", " ", "@", "laoshipukong", " ", ":", " ", "27", "\u65e5", "\uff0c", "\u5168\u56fd\u4eba", "\u5927\u5e38\u59d4\u4f1a", "\u7b2c\u4e09\u6b21", "\u5ba1\u8bae", "\u4fb5\u6743\u8d23", "\u4efb\u6cd5", "\u8349\u6848", "\uff0c", "\u5220\u9664", "\u4e86", "\u6709", "\u5173\u533b\u7597", "\u635f\u5bb3", "\u8d23\u4efb", "\u201c", "\u4e3e\u8bc1", "\u5012", "\u7f6e", "\u201d", "\u7684", "\u89c4\u5b9a", "\u3002", "\u5728", "\u533b\u60a3", "\u7ea0\u7eb7", "\u4e2d\u672c", "\u5df2", "\u5904\u4e8e", "\u5f31\u52bf", "\u5730\u4f4d", "\u7684", "\u6d88\u8d39\u8005", "\u7531", "\u6b64", "\u5c06", "\u9677\u5165", "\u4e07\u52ab", "\u4e0d\u590d", "\u7684", "\u5883\u5730", "\u3002", " "},
		[]string{"\u5927"},
		[]string{},
		[]string{"\u4ed6", "\u8bf4", "\u7684", "\u786e\u5b9e", "\u5728", "\u7406"},
		[]string{"\u957f\u6625\u5e02", "\u957f\u6625\u8282", "\u8bb2\u8bdd"},
		[]string{"\u7ed3\u5a5a", "\u7684", "\u548c", "\u5c1a\u672a", "\u7ed3\u5a5a", "\u7684"},
		[]string{"\u7ed3\u5408\u6210", "\u5206\u5b50", "\u65f6"},
		[]string{"\u65c5\u6e38", "\u548c", "\u670d\u52a1", "\u662f", "\u6700", "\u597d", "\u7684"},
		[]string{"\u8fd9\u4ef6", "\u4e8b\u60c5", "\u7684", "\u786e\u662f", "\u6211", "\u7684", "\u9519"},
		[]string{"\u4f9b\u5927\u5bb6", "\u53c2\u8003", "\u6307\u6b63"},
		[]string{"\u54c8\u5c14\u6ee8", "\u653f\u5e9c", "\u516c\u5e03\u584c\u6865", "\u539f\u56e0"},
		[]string{"\u6211", "\u5728", "\u673a\u573a", "\u5165\u53e3", "\u5904"},
		[]string{"\u90a2\u6c38\u81e3", "\u6444\u5f71", "\u62a5\u9053"},
		[]string{"BP", "\u795e\u7ecf", "\u7f51\u7edc", "\u5982\u4f55", "\u8bad\u7ec3", "\u624d", "\u80fd", "\u5728", "\u5206\u7c7b", "\u65f6", "\u589e\u52a0\u533a", "\u5206\u5ea6", "\uff1f"},
		[]string{"\u5357\u4eac\u5e02", "\u957f\u6c5f\u5927\u6865"},
		[]string{"\u5e94\u4e00\u4e9b", "\u4f7f", "\u7528\u8005", "\u7684", "\u5efa\u8bae", "\uff0c", "\u4e5f", "\u4e3a", "\u4e86", "\u4fbf", "\u4e8e", "\u5229\u7528", "NiuTrans", "\u7528\u4e8e", "SMT", "\u7814\u7a76"},
		[]string{"\u957f\u6625\u5e02", "\u957f\u6625\u836f\u5e97"},
		[]string{"\u9093\u9896", "\u8d85\u751f", "\u524d", "\u6700", "\u559c\u6b22", "\u7684", "\u8863\u670d"},
		[]string{"\u80e1\u9526\u6d9b", "\u662f", "\u70ed\u7231\u4e16\u754c", "\u548c", "\u5e73", "\u7684", "\u653f\u6cbb\u5c40", "\u5e38\u59d4"},
		[]string{"\u7a0b\u5e8f\u5458", "\u795d\u6d77\u6797", "\u548c", "\u6731\u4f1a\u9707", "\u662f", "\u5728", "\u5b59\u5065", "\u7684", "\u5de6\u9762", "\u548c", "\u53f3\u9762", ",", " ", "\u8303\u51ef", "\u5728", "\u6700\u53f3\u9762", ".", "\u518d\u5f80", "\u5de6", "\u662f", "\u674e\u677e\u6d2a"},
		[]string{"\u4e00\u6b21\u6027", "\u4ea4\u591a\u5c11", "\u94b1"},
		[]string{"\u4e24\u5757", "\u4e94\u4e00\u5957", "\uff0c", "\u4e09\u5757", "\u516b\u4e00\u65a4", "\uff0c", "\u56db\u5757", "\u4e03", "\u4e00\u672c", "\uff0c", "\u4e94\u5757", "\u516d", "\u4e00\u6761"},
		[]string{"\u5c0f", "\u548c", "\u5c1a\u7559", "\u4e86", "\u4e00\u4e2a", "\u50cf", "\u5927", "\u548c", "\u5c1a", "\u4e00\u6837", "\u7684", "\u548c", "\u5c1a\u5934"},
		[]string{"\u6211", "\u662f", "\u4e2d\u534e\u4eba\u6c11\u5171\u548c\u56fd", "\u516c\u6c11", ";", "\u6211", "\u7238\u7238", "\u662f", "\u5171", "\u548c", "\u515a", "\u515a\u5458", ";", " ", "\u5730\u94c1", "\u548c", "\u5e73\u95e8", "\u7ad9"},
		[]string{"\u5f20\u6653\u6885", "\u53bb", "\u4eba\u6c11\u533b\u9662", "\u505a", "\u4e86", "\u4e2a", "B", "\u8d85\u7136", "\u540e", "\u53bb", "\u4e70", "\u4e86", "\u4ef6", "T", "\u6064"},
		[]string{"AT", "&", "T", "\u662f", "\u4e00\u4ef6", "\u4e0d\u9519", "\u7684", "\u516c\u53f8", "\uff0c", "\u7ed9", "\u4f60", "\u53d1", "offer", "\u4e86", "\u5417", "\uff1f"},
		[]string{"C", "++", "\u548c", "c", "#", "\u662f", "\u4ec0\u4e48", "\u5173\u7cfb", "\uff1f", "11", "+", "122", "=", "133", "\uff0c", "\u662f", "\u5417", "\uff1f", "PI", "=", "3.14159"},
		[]string{"\u4f60", "\u8ba4\u8bc6", "\u90a3\u4e2a", "\u548c", "\u4e3b\u5e2d\u63e1", "\u624b", "\u7684", "\u7684", "\u54e5", "\u5417", "\uff1f", "\u4ed6\u5f00", "\u4e00\u8f86", "\u9ed1\u8272", "\u7684", "\u58eb", "\u3002"},
		[]string{"\u67aa\u6746\u5b50", "\u4e2d", "\u51fa\u653f\u6743"},
	}
)

func init() {
	SetDictionary("dict.txt")
}

func TestCutDAG(t *testing.T) {
	result := cut_DAG("BP神经网络如何训练才能在分类时增加区分度？")
	if len(result) != 11 {
		t.Error(result)
	}
}

func TestCutDAGNoHmm(t *testing.T) {
	result := cut_DAG_NO_HMM("BP神经网络如何训练才能在分类时增加区分度？")
	if len(result) != 11 {
		t.Error(result)
	}
}

func TestRegexpSplit(t *testing.T) {
	result := RegexpSplit(regexp.MustCompile(`\p{Han}+`),
		"BP神经网络如何训练才能在分类时增加区分度？")
	if len(result) != 3 {
		t.Error(result)
	}
	result = RegexpSplit(regexp.MustCompile(`([\p{Han}#]+)`),
		",BP神经网络如何训练才能在分类时#增加区分度？")
	if len(result) != 3 {
		t.Error(result)
	}
}

func TestDefaultCut(t *testing.T) {
	var result []string
	for index, content := range test_contents {
		result = Cut(content, false, true)
		if len(result) != len(defaultCutResult[index]) {
			t.Errorf("default cut for %s length should be %d not %d\n",
				content, len(defaultCutResult[index]), len(result))
		}
		for i, r := range result {
			if r != defaultCutResult[index][i] {
				t.Error(r)
			}
		}
	}
}

func TestCutAll(t *testing.T) {
	var result []string
	for index, content := range test_contents {
		result = Cut(content, true, true)
		if len(result) != len(cutAllResult[index]) {
			t.Errorf("cut all for %s length should be %d not %d\n",
				content, len(cutAllResult[index]), len(result))
		}
		for i, c := range result {
			if c != cutAllResult[index][i] {
				t.Error(c)
			}
		}
	}
}

func TestDefaultCutNoHMM(t *testing.T) {
	var result []string
	for index, content := range test_contents {
		result = Cut(content, false, false)
		if len(result) != len(defaultCutNoHMMResult[index]) {
			t.Errorf("default cut no hmm for %s length should be %d not %d\n",
				content, len(defaultCutNoHMMResult[index]), len(result))
		}
		for i, c := range result {
			if c != defaultCutNoHMMResult[index][i] {
				t.Error(c)
			}
		}
	}
}

func TestCutForSearch(t *testing.T) {
	var result []string
	for index, content := range test_contents {
		result = CutForSearch(content, true)
		if len(result) != len(cutForSearchResult[index]) {
			t.Errorf("cut for search for %s length should be %d not %d\n",
				content, len(cutForSearchResult[index]), len(result))
		}
		for i, c := range result {
			if c != cutForSearchResult[index][i] {
				t.Error(c)
			}
		}
	}
	for index, content := range test_contents {
		result = CutForSearch(content, false)
		if len(result) != len(cutForSearchNoHMMResult[index]) {
			t.Errorf("cut for search no hmm for %s length should be %d not %d\n",
				content, len(cutForSearchNoHMMResult[index]), len(result))
		}
		for i, c := range result {
			if c != cutForSearchNoHMMResult[index][i] {
				t.Error(c)
			}
		}
	}
}

func TestSetdictionary(t *testing.T) {
	var result []string
	SetDictionary("foobar.txt")
	for index, content := range test_contents {
		result = Cut(content, false, true)
		if len(result) != len(userDictCutResult[index]) {
			t.Errorf("default cut with user dictionary for %s length should be %d not %d\n",
				content, len(userDictCutResult[index]), len(result))
		}
		for i, c := range result {
			if c != userDictCutResult[index][i] {
				t.Error(c)
			}
		}
	}
}

func TestLoadUserDict(t *testing.T) {
	SetDictionary("dict.txt")
	LoadUserDict("userdict.txt")

	sentence := "李小福是创新办主任也是云计算方面的专家; 什么是八一双鹿例如我输入一个带“韩玉赏鉴”的标题，在自定义词库中也增加了此词为N类型"
	result := []string{"\u674e\u5c0f\u798f", "\u662f", "\u521b\u65b0\u529e", "\u4e3b\u4efb", "\u4e5f", "\u662f", "\u4e91\u8ba1\u7b97", "\u65b9\u9762", "\u7684", "\u4e13\u5bb6", ";", " ", "\u4ec0\u4e48", "\u662f", "\u516b\u4e00\u53cc\u9e7f", "\u4f8b\u5982", "\u6211", "\u8f93\u5165", "\u4e00\u4e2a", "\u5e26", "\u201c", "\u97e9\u7389\u8d4f\u9274", "\u201d", "\u7684", "\u6807\u9898", "\uff0c", "\u5728", "\u81ea\u5b9a\u4e49\u8bcd", "\u5e93\u4e2d", "\u4e5f", "\u589e\u52a0", "\u4e86", "\u6b64", "\u8bcd\u4e3a", "N", "\u7c7b\u578b"}

	words := Cut(sentence, false, true)
	if len(words) != len(result) {
		t.Error(len(words))
	}
	for index, word := range words {
		if word != result[index] {
			t.Error(word)
		}
	}

	sentence = "easy_install is great"
	result = []string{"easy_install", " ", "is", " ", "great"}
	words = Cut(sentence, false, true)
	if len(words) != len(result) {
		t.Error(len(words))
	}
	for index, word := range words {
		if word != result[index] {
			t.Error(word)
		}
	}

	sentence = "python 的正则表达式是好用的"
	result = []string{"python", " ", "\u7684", "\u6b63\u5219\u8868\u8fbe\u5f0f", "\u662f", "\u597d\u7528", "\u7684"}
	words = Cut(sentence, false, true)
	if len(words) != len(result) {
		t.Error(words)
		t.Error(result)
	}
	for index, word := range words {
		if word != result[index] {
			t.Error(word)
		}
	}
}
